# 3. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Без использования встроенной функции преобразования, без строк. Без использования встроенной функции преобразования, без строк.



print ("Введите число в десятичной системе исчесления: ")
number = int(input())

s =co