# 3. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Без использования встроенной функции преобразования, без строк. Без использования встроенной функции преобразования, без строк.



print ("Введите число в десятичной системе исчесления: ")
number = int(input())

# newNumber = 1
lst = []
# delta = 2

while number > 0:
    lst.append(number%2)

# print (newNumber)
